<template>
  <div class="grammar-test">
    <h2>Правило «10-ти друзей»</h2>

    <p>
      Мастерству поддержки не научиш<gap
        id="0"
        :fills="['слитно', 'ь']"
        correct="ь"
      />ся в университете<gap
        id="1"
        :fills="[',', '_']"
        correct=","
      /> но как тогда стать кла<gap
        id="2"
        :fills="['с', 'сс']"
        correct="сс"
      />ным саппортом? Как почу<gap
        id="3"
        :fills="['слитно', 'в']"
        correct="в"
      />ствовать грань между не<gap
        id="4"
        :fills="['слитно', 'раздельно']"
        correct="слитно"
      />формальностью и панибратством и не переступать ее? Когда кто<gap
        id="5"
        :fills="['-', '_']"
        correct="-"
      />то приходит в Рокетбанк работать в саппорт<gap
        id="6"
        :fills="[',', '_']"
        correct=","
      /> первое<gap
        id="7"
        :fills="[',', '_']"
        correct=","
      /> что мы делаем<gap
        id="8"
        :fills="[',', '_']"
        correct=","
      /> это ра<gap
        id="9"
        :fills="['с', 'сс']"
        correct="сс"
      />казываем наше базовое правило отношения к клиентам <gap
        id="10"
        :fills="['—', '_']"
        correct="—"
      /> «правило 10 друзей».
    </p>

    <p>
      У каждого из нас есть один или два<gap
        id="11"
        :fills="[',', '_']"
        correct=","
      /> а<gap
        id="12"
        :fills="[',', '_']"
        correct="_"
      /> может быть<gap
        id="13"
        :fills="[',', '_']"
        correct="_"
      /> и три<gap
        id="14"
        :fills="[',', '_']"
        correct=","
      /> самых бли<gap
        id="15"
        :fills="['с', 'з']"
        correct="з"
      />ких друга. Мы знакомы уже миллион лет или всего пару месяцев <gap
        id="16"
        :fills="['_', ',', '—']"
        correct="—"
      /> неважно<gap
        id="17"
        :fills="[',', '_']"
        correct=","
      /> главное<gap
        id="18"
        :fills="[',', '_']"
        correct=","
      /> что с этими людьми можно обсудить все на свете — от стра<gap
        id="19"
        :fills="['н', 'нн']"
        correct="нн"
      />ых шуток до личных переж<gap
        id="20"
        :fills="['е', 'и']"
        correct="и"
      />ваний<gap
        id="21"
        :fills="[',', '_']"
        correct=","
      /> и они нас понимают<gap
        id="22"
        :fills="[',', '_']"
        correct=","
      /> прин<gap
        id="23"
        :fills="['е', 'и']"
        correct="и"
      />мают и поддерживают всегда. Конечно<gap
        id="24"
        :fills="[',', '_']"
        correct=","
      /> на этом наш круг общения не ограничивае<gap
        id="25"
        :fills="['тс', 'тьс']"
        correct="тс"
      />я, и есть еще<gap
        id="26"
        :fills="[',', '_']"
        correct=","
      /> например<gap
        id="27"
        :fills="[',', '_']"
        correct=","
      /> 10 друзей<gap
        id="28"
        :fills="[',', '_']"
        correct=","
      /> с которыми мы не ведем задушевные беседы<gap
        id="29"
        :fills="[',', '_']"
        correct=","
      /> но которым всегда готовы помочь<gap
        id="30"
        :fills="[',', '_']"
        correct=","
      /> если это понадоби<gap
        id="31"
        :fills="['тс', 'тьс']"
        correct="тс"
      />я и в наших силах оказать помощь. Например<gap
        id="32"
        :fills="[',', '_']"
        correct=","
      /> вспомните своих одногруппников. Н<gap
        id="33"
        :fills="['е', 'и']"
        correct="е"
      /> с каждым сложились очень бли<gap
        id="34"
        :fills="['з', 'с']"
        correct="з"
      />кие отношения<gap
        id="35"
        :fills="[',', '_']"
        correct=","
      /> но все были одной командой<gap
        id="36"
        :fills="[',', '_']"
        correct=","
      /> уважали друг друга<gap
        id="37"
        :fills="[',', '_']"
        correct="_"
      /> и спрашивали «как дела?» по утрам.
    </p>

    <p>
      Так вот<gap
        id="38"
        :fills="[',', '_']"
        correct=","
      /> в Рокетбанке общаю<gap
        id="39"
        :fills="['тс', 'тьс']"
        correct="тс"
      />я с клиентами так<gap
        id="40"
        :fills="['-', '_', ',']"
        correct="_"
      />же<gap
        id="41"
        :fills="[',', '_']"
        correct=","
      /> как с этими десятью друзьями: уважительно<gap
        id="42"
        :fills="[',', '_']"
        correct=","
      /> но без официоза<gap
        id="43"
        :fills="[',', '_']"
        correct=","
      /> заботливо<gap
        id="44"
        :fills="[',', '_']"
        correct=","
      /> но без панибратства. Если всегда держать в голове<gap
        id="45"
        :fills="[',', '_']"
        correct=","
      /> что клиентом может оказа<gap
        id="46"
        :fills="['тс', 'тьс']"
        correct="тьс"
      />я тот самый парень<gap
        id="47"
        :fills="[',', '_']"
        correct=","
      /> который выручал на а<gap
        id="48"
        :fills="['т', 'тт']"
        correct="тт"
      />естациях<gap
        id="49"
        :fills="[',', '_']"
        correct=","
      /> то вря<gap
        id="50"
        :fills="['т', 'д']"
        correct="д"
      /> ли вы напиш<gap
        id="51"
        :fills="['и', 'е']"
        correct="е"
      />те ему простую отписку<gap
        id="52"
        :fills="[',', '_']"
        correct=","
      /> не разобравшись<gap
        id="53"
        :fills="[',', '_']"
        correct=","
      /> в чем его проблема<gap
        id="54"
        :fills="[',', '_']"
        correct=","
      /> но и не стан<gap
        id="55"
        :fills="['е', 'и']"
        correct="е"
      />те сильно лезть в душу<gap
        id="56"
        :fills="[',', '_']"
        correct=","
      /> заваливать смайликами и смешными картинками<gap
        id="57"
        :fills="[',', '_']"
        correct=","
      /> если в данной ситуации от вас этого не ждут.
    </p>

    <p>
      Когда в понедельник вы придете на работу и нужно будет отвечать клиентам<gap
        id="58"
        :fills="[',', '_']"
        correct=","
      /> стоит вспомнить кого<gap
        id="59"
        :fills="['-', '_']"
        correct="-"
      />то из вашего круга десяти друзей и представить<gap
        id="60"
        :fills="[',', '_']"
        correct=","
      /> что клиент это он и есть. Уверяю<gap
        id="61"
        :fills="[',', '_']"
        correct=","
      /> ответ будет пропитан искре<gap
        id="62"
        :fills="['н', 'нн']"
        correct="нн"
      />им желанием помочь<gap
        id="63"
        :fills="[',', '_']"
        correct=","
      /> а сам текст перестанет быть таким угловатым и перегруже<gap
        id="64"
        :fills="['н', 'нн']"
        correct="нн"
      />ым сложными оборотами. Вот с такой простой формулы начинается рокетстиль.
    </p>
  </div>
</template>

<script>
import Gap from './Gap';
    
export default {
  components: {
    Gap
  },
  data () {
    return {
      variants: [
        {
          fills: '[\'слитно\', \'ь\']',
          correct: 'ь'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'с\', \'сс\']',
          correct: 'сс'
        },
        {
          fills: '[\'слитно\', \'в\']',
          correct: 'в'
        },
        {
          fills: '[\'слитно\', \'раздельно\']',
          correct: 'слитно'
        },
        {
          fills: '[\'-\', \'_\']',
          correct: '-'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ',' 
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'с\', \'сс\']',
          correct: 'сс'
        },
        {
          fills: '[\'—\', \'\']',
          correct: '—'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: '_'
        },
        {
          fills: '[\',\', \'_\']',
          correct: '_'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'с\', \'з\']',
          correct: 'з'
        },
        {
          fills: '[\'_\', \',\', \'—\']',
          correct: '—'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'н\', \'нн\']',
          correct: 'нн'
        },
        {
          fills: '[\'е\', \'и\']',
          correct: 'и'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'е\', \'и\']',
          correct: 'и'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'тс\', \'тьс\']',
          correct: 'тс'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'тс\', \'тьс\']',
          correct: 'тс'
        },
        {
          fills: '[\',\', \'\']',
          correct: ','
        },
        {
          fills: '[\'е\', \'и\']',
          correct: 'е'
        },
        {
          fills: '[\'з\', \'с\']',
          correct: 'з'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ''
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'тс\', \'тьс\']',
          correct: 'тс'
        },
        {
          fills: '[\'-\', \'_\', \',\']',
          correct: '_'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'тс\', \'тьс\']',
          correct: 'тьс'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'т\', \'тт\']',
          correct: 'тт'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'т\', \'д\']',
          correct: 'д'
        },
        {
          fills: '[\'и\', \'е\']',
          correct: 'е'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'е\', \'и\']',
          correct: 'е'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'-\', \'_\']',
          correct: '-'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'н\', \'нн\']',
          correct: 'нн'
        },
        {
          fills: '[\',\', \'_\']',
          correct: ','
        },
        {
          fills: '[\'н\', \'нн\']',
          correct: 'нн'
        }
      ]
    };
  },
  mounted() {
    this.$emit('gapData', this.variants);
  },
  methods: {
  }
};
</script>

<style lang="scss">
</style>