<template>
    <div class="grammar-test">
        <h2>История Рокетбанка</h2>
        
        <p>В 2018 году Рокетбанку исполнилось н<gap id="0" :fills="['е', 'и']" correct="и" /> много н<gap id="1" :fills="['е', 'и']" correct="и" /> мало пять лет. И этого не<gap id="2" :fills="['слитно', 'раздельно']" correct="слитно" />большого времени хватило<gap id="3" :fills="[',', '_']" correct="," /> чтобы доказать<gap id="4" :fills="[',', '_']" correct="," /> что банк может быть не<gap id="5" :fills="['слитно', 'раздельно']" correct="раздельно" />привычным потоком из бесконечных очередей и талонч<gap id="6" :fills="['и', 'е']" correct="и" />ков<gap id="7" :fills="['_', ',']" correct="," /> а удобным сервисом с «человеческим лицом».<p>
        
        <p>Историю начали четыре фаундера — Олег Козырев, Михаил Провизион, Алексей Колесников и Виктор Лысенко. В<gap id="8" :fills="['слитно', 'раздельно']" correct="раздельно" />течени<gap id="9" :fills="['е', 'и']" correct="е" /> первых полутора лет они пр<gap id="10" :fills="['и', 'е']" correct="и" />вл<gap id="11" :fills="['е', 'и']" correct="е" />кли инвесторов<gap id="12" :fills="['_', ',']" correct="," /> договорились с Интеркоммерцем<gap id="13" :fills="[',', '_']" correct="," /> первым банком-партнером<gap id="14" :fills="[',', '_']" correct="," /> сделали мобильное приложение<gap id="15" :fills="['_', ',']" correct="," /> обсудили прав<gap id="16" :fills="['о', 'а']" correct="о" />мерное и<gap id="17" :fills="['c', 'з']" correct="c" />пользование картинок со Старбаксом и познакомились с Олегом Тиньковым. ;)</p>

        <p>Рокетбанк был ни<gap id="18" :fills="['слитно', 'раздельно']" correct="слитно" />чуть н<gap id="19" :fills="['и', 'е']" correct="е" /> похож на другие банки. Мгнове<gap id="20" :fills="['н', 'нн']" correct="нн" />ые переводы друзьям без рекв<gap id="21" :fills="['и', 'е']" correct="и" />зитов<gap id="22" :fills="['_', ',']" correct="," /> красивая лента операций<gap id="23" :fills="['_', ',']" correct="," /> возможность снимать наличные бе<gap id="24" :fills="['c', 'з']" correct="c" />платно в любом банкомате мира<gap id="25" :fills="[',', '_']" correct="," /> а так<gap id="26" :fills="['слитно', 'раздельно']" correct="слитно" />же поддержка без ботов произвели вау-эффект. Первые клиенты советовали Рокетбанк друзьям — и за<gap id="27" :fills="['слитно', 'раздельно']" correct="раздельно" />счет этого сервис стал расти.</p>
        
        <p>Дальше был отзыв л<gap id="28" :fills="['е', 'и']" correct="и" />цензии у Интеркоммерца<gap id="29" :fills="[',', '_']" correct="," /> партнерство с Открытием и «кабель». Важно<gap id="30" :fills="['_', ',']" correct="," /> что в каждой сложной ситуации команда находила решение<gap id="31" :fills="['_', ',']" correct="," /> которое<gap id="32" :fills="['_', ',']" correct="," /> в первую очередь<gap id="33" :fills="[',', '_']" correct="," /> было наиболее удобным для пользователей.<p>
        
        <p>Сейчас Рокетбанк работает вместе с QIWI. Новая эра только начинается<gap id="34" :fills="['_', ',']" correct="," /> но нет н<gap id="35" :fills="['е', 'и']" correct="и" /> капли сомнения<gap id="36" :fills="['_', ',']" correct="," /> что это пут<gap id="37" :fills="['и', 'е']" correct="е" />шествие будет еще интереснее<gap id="38" :fills="[',', '_']" correct="," /> чем пр<gap id="39" :fills="['и', 'е']" correct="е" />дыдущие.</p>
    </div>
</template>

<script>
    import Gap from './Gap'
    
    export default {
        components: {
            Gap
        },
        data () {
            return {
                variants: [
                    {
                        fills: "['е', 'и']",
                        correct: "и"
                    },
                    {
                        fills: "['е', 'и']",
                        correct: "и"
                    },
                    {
                        fills: "['слитно', 'раздельно']",
                        correct: "слитно"
                    },
                    {
                        fills: "[',', '_']",
                        correct: "," 
                    },
                    {
                        fills: "[',', '_']",
                        correct: ","
                    },
                    {
                        fills: "['слитно', 'раздельно']",
                        correct: "раздельно"
                    },
                    {
                        fills: "['и', 'е']",
                        correct: "и"
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['слитно', 'раздельно']",
                        correct: "раздельно"
                    },
                    {
                        fills: "['е', 'и']",
                        correct: "е"
                    },
                    {
                        fills: "['и', 'е']",
                        correct: "и"
                    },
                    {
                        fills: "['е', 'и']",
                        correct: "е"
                    },
                    {
                        fills: "['_', ',']",
                        correct: "," 
                    },
                    {
                        fills: "[',', '_']",
                        correct: ","
                    }, 
                    {
                        fills: "[',', '_']",
                        correct: ","
                    },
                    {
                        fills: "['_', ',']",
                        correct: "," 
                    },
                    {
                        fills: "['о', 'а']",
                        correct: "о"
                    },
                    {
                        fills: "['c', 'з']",
                        correct: "c"
                    },
                    {
                        fills: "['слитно', 'раздельно']",
                        correct: "слитно"
                    },
                    {
                        fills: "['и', 'е']",
                        correct: "е"
                    },
                    {
                        fills: "['н', 'нн']",
                        correct: "нн"
                    },
                    {
                        fills: "['и', 'е']",
                        correct: "и"
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['c', 'з']",
                        correct: "c"
                    },
                    {
                        fills: "[',', '_']",
                        correct: ","
                    },
                    {
                        fills: "['слитно', 'раздельно']",
                        correct: "слитно"
                    },
                    {
                        fills: "['слитно', 'раздельно']",
                        correct: "раздельно"
                    },
                    {
                        fills: "['е', 'и']",
                        correct: "и"
                    },
                    {
                        fills: "[',', '_']",
                        correct: ","
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "[',', '_']",
                        correct: ","
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['е', 'и']",
                        correct: "и"
                    },
                    {
                        fills: "['_', ',']",
                        correct: ","
                    },
                    {
                        fills: "['и', 'е']",
                        correct: "е"
                    },
                    {
                        fills: "[',', '_']",
                        correct: ","
                    },
                    {
                        fills: "['и', 'е']",
                        correct: "е"
                    }
                ]
            }
        },
        mounted() {
            this.$emit('gapData', this.variants)
        },
        methods: {
        }
    }
</script>

<style lang="scss">
</style>