<template>
    <div class="grammar-test">
        <p>Нам в Рокетбанке каже<gap id="0" :fills="['тс', 'тьс']" correct="тс" />я<gap id="1" :fills="['_', ',']" correct="," /> что поддержка — это не<gap id="2" :fills="['слитно', 'раздельно']" correct="раздельно" />просто умение отвечать на вопросы<gap id="3" :fills="[',', '_']" correct="_" /> заранее подготовленными ответами<gap id="4" :fills="[',', '_']" correct="," /> это состояние души. ❤️ Тогда<gap id="5" :fills="['_', ',']" correct="_" /> кто такой классный саппорт? Какие качества помогают ему делать по<gap id="6" :fills="['-', '_']" correct="-" />настоящему удобный сервис?</p>

        <p>Первое — умен<gap id="7" :fills="['ее', 'ие']" correct="ие" /> увид<gap id="8" :fills="['и', 'е']" correct="е" />ть реальный вопрос. Что это значит? Если коротко<gap id="9" :fills="['_', ',']" correct="," /> то когда клиент спрашивает<gap id="10" :fills="[',', '_']" correct="," /> почему не проходит перевод<gap id="11" :fills="[',', '_']" correct="," /> то он совсем не обязательно под словом «перевод» имеет в<gap id="12" :fills="['слитно', 'раздельно']" correct="раздельно" />виду име<gap id="13" :fills="['нн', 'н']" correct="нн" />о отправку денег другому человеку. Он может иметь в<gap id="14" :fills="['слитно', 'раздельно']" correct="раздельно" />виду и пополнение<gap id="15" :fills="[',', '_']" correct="," /> и оплату услуг<gap id="16" :fills="[',', '_']" correct="," /> и мало ли что ещё. Вот главная задача саппорта — взглянуть на вопрос критически<gap id="17" :fills="[',', '_']" correct="," /> с пол<gap id="18" :fills="['у', 'слитно']" correct="у" />слова понять<gap id="19" :fills="['_', ',']" correct="," /> в чем дело. И чем быстрее это сделать<gap id="20" :fills="[',', '_']" correct="," /> тем комфортнее будет клиенту. Он точно подумает<gap id="21" :fills="[',', '_']" correct="," /> что это просто вау-сервис какой<gap id="22" :fills="['-', '_']" correct="-" />то 🙂</p>

        <p>Второе — дружелюбие. Кому вообще нравя<gap id="23" :fills="['тс', 'тьс']" correct="тс" />я буки и злючки? Обычно в поддержку пишешь<gap id="24" :fills="['_', ',']" correct="," /> потому что уже испытываешь дискомфорт или стресс<gap id="25" :fills="[',', '_']" correct="," /> так как в чем<gap id="26" :fills="['-', '_']" correct="-" />то не разобрался сам или возникла проблема. А если в поддержке при этом тебе нагрубят<gap id="27" :fills="[',', '_']" correct="," /> то испорче<gap id="28" :fills="['н', 'нн']" correct="нн" />ое настроение гарантирова<gap id="29" :fills="['н', 'нн']" correct="н" />о.</p>

        <p>Третье — скорость ответа. Долгое ожидание изматывает и злит<gap id="30" :fills="[',', '_']" correct="," /> особенно в ситуациях<gap id="31" :fills="['_', ',']" correct="," /> когда реакция нужна не<gap id="32" :fills="['раздельно', 'слитно']" correct="слитно" />замедлительно — банкомат съел деньги или моше<gap id="33" :fills="['н', 'нн']" correct="нн" />ик украл данные карты. Чем быстрее поддержка может решить проблему<gap id="34" :fills="[',', '_']" correct="," /> тем счастливее будет юзер.</p>

        <p>Четвертое — грамотная речь. Залог доверия к саппорту. Действительно<gap id="35" :fills="[',', '_']" correct="," /> если в саппорте общаю<gap id="36" :fills="['тьс', 'тс']" correct="тс" />я с ошибками<gap id="37" :fills="[',', '_']" correct="," /> не утруждая себя проверкой написа<gap id="38" :fills="['нн', 'н']" correct="нн" />ого<gap id="39" :fills="[',', '_']" correct="," /> то как они там справя<gap id="40" :fills="['тс', 'тьс']" correct="тс" />я с серьезными вопросами по такой щеп<gap id="41" :fills="['и', 'е']" correct="е" />тильной теме<gap id="42" :fills="[',', '_']" correct="," /> как деньги?</p>

        <p>И пятое<gap id="43" :fills="['_', ',']" correct="," /> душевность. Или персональный подход. Предложить альтернативы<gap id="44" :fills="[',', '_']" correct="," /> пред<gap id="45" :fills="['ъ', 'слитно']" correct="слитно" />угадать проблемы<gap id="46" :fills="['_', ',']" correct="," /> взглянуть на ситуацию со стороны конкретного пользователя — просто помогать<gap id="47" :fills="[',', '_']" correct="," /> по<gap id="48" :fills="['-', '_']" correct="-" />доброму<gap id="49" :fills="[',', '_']" correct="," /> н<gap id="50" :fills="['и', 'е']" correct="и" />кем не пр<gap id="51" :fills="['е', 'и']" correct="и" />творяясь<gap id="52" :fills="[',', '_']" correct="," /> рассматривая каждую ситуацию индивидуально.</p>
    </div>
</template>

<script>
    import Gap from './Gap'
    
    export default {
        components: {
            Gap
        },
        data () {
            return {
                variants: [
                    {
                        fills: "['тс', 'тьс']",
                        correct: "тс"
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "['слитно', 'раздельно']",
                        correct: "раздельно"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: "_"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['_', ',']",
                        correct: "_"
                    },
                    { 
                        fills: "['-', '_']",
                        correct: "-"
                    },
                    { 
                        fills: "['ее', 'ие']",
                        correct: "ие"
                    },
                    { 
                        fills: "['и', 'е']",
                        correct: "е"
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['слитно', 'раздельно']",
                        correct: "раздельно"
                    },
                    { 
                        fills: "['нн', 'н']",
                        correct: "нн"
                    },
                    { 
                        fills: "['слитно', 'раздельно']",
                        correct: "раздельно"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['у', 'слитно']",
                        correct: "у"
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['-', '_']",
                        correct: "-"
                    },
                    { 
                        fills: "['тс', 'тьс']",
                        correct: "тс"
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['-', '_']",
                        correct: "-"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['н', 'нн']",
                        correct: "нн"
                    },
                    { 
                        fills: "['н', 'нн']",
                        correct: "н"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "['раздельно', 'слитно']",
                        correct: "слитно"
                    },
                    { 
                        fills: "['н', 'нн']",
                        correct: "нн"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['тьс', 'тс']",
                        correct: "тс"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['нн', 'н']",
                        correct: "нн"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['тс', 'тьс']",
                        correct: "тс"
                    },
                    { 
                        fills: "['и', 'е']",
                        correct: "е"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['ъ', 'слитно']",
                        correct: "слитно"
                    },
                    { 
                        fills: "['_', ',']",
                        correct: ","
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['-', '_']",
                        correct: "-"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    },
                    { 
                        fills: "['и', 'е']",
                        correct: "и"
                    },
                    { 
                        fills: "['е', 'и']",
                        correct: "и"
                    },
                    { 
                        fills: "[',', '_']",
                        correct: ","
                    }
                ]
            }
        },
        mounted() {
            this.$emit('gapData', this.variants)
        },
        methods: {
        }
    }
</script>

<style lang="scss">
</style>